* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
| Nærumbanen (2T)            |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Move between connected segments)
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.004 |    0.003 |    0.004 | 3.6666667e-3 |
| Example with two trains    |    0.014 |    0.016 |    0.013 |  0.014333333 |
| Shared Segment             |    0.015 |    0.018 |    0.018 |        0.017 |
| Large Network              |    0.011 |    0.026 |    0.025 |  0.020666667 |
| Station One                |    0.010 |    0.010 |    0.021 |  0.013666667 |
| Station Two                |    0.075 |    0.097 |    0.079 |  0.083666667 |
| Station Four               |    1.494 |    1.396 |    1.355 |        1.415 |
| Station Six                |   22.872 |   23.017 |   22.706 |       22.865 |
| Station Eight              |  135.759 |  133.936 |  134.133 |    134.60933 |
| Station Ten                |  475.160 |  477.251 |  474.018 |    475.47633 |
| Station Twelfth            | 1357.894 | 1340.195 | 1289.723 |    1329.2707 |
| Two trains same direction  |    0.022 |    0.024 |    0.026 |        0.024 |
| Four trains same direction |  835.163 |  830.236 |  833.745 |      833.048 |
| Nærumbanen (2T)            |   20.145 |   19.258 |   19.238 |       19.547 |
| Nærumbanen (3T)            |  317.762 |  318.903 |  324.661 |      320.442 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   7.640 |   7.652 |   7.656 | 7.6493333 |
| Example with two trains    |   8.576 |   8.584 |   8.588 | 8.5826667 |
| Shared Segment             |   9.816 |   9.848 |   9.852 | 9.8386667 |
| Large Network              |  12.024 |  12.072 |  12.084 |     12.06 |
| Station One                |   8.544 |   8.552 |   8.560 |     8.552 |
| Station Two                |  14.256 |  14.308 |  14.320 | 14.294667 |
| Station Four               |  37.932 |  38.164 |  38.172 | 38.089333 |
| Station Six                | 105.136 | 105.888 | 105.888 | 105.63733 |
| Station Eight              | 221.068 | 222.868 | 222.868 |   222.268 |
| Station Ten                | 424.840 | 428.096 | 428.268 |   427.068 |
| Station Twelfth            | 725.592 | 732.964 | 732.964 | 730.50667 |
| Two trains same direction  |  11.664 |  11.700 |  11.704 | 11.689333 |
| Four trains same direction | 686.480 | 686.620 | 686.636 | 686.57867 |
| Nærumbanen (2T)            | 117.620 | 118.440 | 118.644 | 118.23467 |
| Nærumbanen (3T)            | 289.164 | 290.112 | 290.112 |   289.796 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.003 |    0.004 |    0.004 | 3.6666667e-3 |
| Example with two trains    |    0.027 |    0.030 |    0.029 |  0.028666667 |
| Shared Segment             |    0.014 |    0.017 |    0.018 |  0.016333333 |
| Large Network              |    0.012 |    0.022 |    0.019 |  0.017666667 |
| Station One                |    0.019 |    0.022 |    0.011 |  0.017333333 |
| Station Two                |    0.067 |    0.077 |    0.078 |        0.074 |
| Station Four               |    1.264 |    1.385 |    1.299 |        1.316 |
| Station Six                |   21.984 |   22.251 |   22.444 |    22.226333 |
| Station Eight              |  135.149 |  134.701 |  136.291 |    135.38033 |
| Station Ten                |  471.003 |  472.720 |  472.425 |    472.04933 |
| Station Twelfth            | 1356.472 | 1356.409 | 1308.059 |    1340.3133 |
| Two trains same direction  |    0.024 |    0.022 |    0.026 |        0.024 |
| Four trains same direction |  819.379 |  779.918 |  786.767 |    795.35467 |
| Nærumbanen (2T)            |   19.946 |   20.036 |   20.275 |    20.085667 |
| Nærumbanen (3T)            |  332.490 |  333.240 |  331.178 |    332.30267 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   7.608 |   7.616 |   7.628 | 7.6173333 |
| Example with two trains    |   8.560 |   8.568 |   8.572 | 8.5666667 |
| Shared Segment             |   9.792 |   9.820 |   9.832 | 9.8146667 |
| Large Network              |  12.004 |  12.052 |  12.064 |     12.04 |
| Station One                |   8.512 |   8.520 |   8.524 | 8.5186667 |
| Station Two                |  12.408 |  12.456 |  12.464 | 12.442667 |
| Station Four               |  36.500 |  36.728 |  36.752 |     36.66 |
| Station Six                | 105.660 | 106.012 | 106.048 | 105.90667 |
| Station Eight              | 219.100 | 220.624 | 220.980 | 220.23467 |
| Station Ten                | 420.864 | 424.288 | 424.460 |   423.204 |
| Station Twelfth            | 724.864 | 727.128 | 732.708 | 728.23333 |
| Two trains same direction  |   9.936 |   9.964 |   9.972 | 9.9573333 |
| Four trains same direction | 687.808 | 687.812 | 687.784 | 687.80133 |
| Nærumbanen (2T)            | 116.124 | 116.940 | 117.144 |   116.736 |
| Nærumbanen (3T)            | 286.900 | 287.556 | 287.852 |   287.436 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.003 |    0.004 |    0.003 | 3.3333333e-3 |
| Example with two trains    |    0.026 |    0.017 |    0.030 |  0.024333333 |
| Shared Segment             |    0.014 |    0.016 |    0.017 |  0.015666667 |
| Large Network              |    0.012 |    0.019 |    0.019 |  0.016666667 |
| Station One                |    0.012 |    0.012 |    0.019 |  0.014333333 |
| Station Two                |    0.065 |    0.111 |    0.114 |  0.096666667 |
| Station Four               |    1.286 |    1.315 |    1.266 |        1.289 |
| Station Six                |   23.164 |   23.206 |   23.325 |    23.231667 |
| Station Eight              |  127.860 |  124.623 |  124.672 |    125.71833 |
| Station Ten                |  474.403 |  459.789 |  444.659 |      459.617 |
| Station Twelfth            | 1337.102 | 1326.536 | 1320.822 |    1328.1533 |
| Two trains same direction  |    0.024 |    0.020 |    0.025 |        0.023 |
| Four trains same direction |  828.480 |  839.239 |  839.249 |      835.656 |
| Nærumbanen (2T)            |   19.309 |   18.324 |   18.342 |    18.658333 |
| Nærumbanen (3T)            |  323.919 |  321.851 |  320.536 |      322.102 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   7.592 |   7.608 |   7.612 |     7.604 |
| Example with two trains    |   8.544 |   8.552 |   8.560 |     8.552 |
| Shared Segment             |   9.772 |   9.808 |   9.820 |       9.8 |
| Large Network              |  11.980 |  12.044 |  12.506 | 12.176667 |
| Station One                |   8.516 |   8.524 |   8.532 |     8.524 |
| Station Two                |  12.384 |  12.436 |  12.444 | 12.421333 |
| Station Four               |  37.948 |  38.172 |  38.184 | 38.101333 |
| Station Six                | 101.400 | 102.152 | 102.160 |   101.904 |
| Station Eight              | 223.784 | 224.888 | 224.888 |    224.52 |
| Station Ten                | 421.316 | 426.156 | 426.156 | 424.54267 |
| Station Twelfth            | 725.644 | 727.908 | 732.620 |   728.724 |
| Two trains same direction  |   9.916 |   9.948 |   9.960 | 9.9413333 |
| Four trains same direction | 688.684 | 688.700 | 688.708 | 688.69733 |
| Nærumbanen (2T)            | 118.312 | 119.176 | 119.984 | 119.15733 |
| Nærumbanen (3T)            | 287.632 | 288.220 | 288.584 | 288.14533 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.003 |    0.003 | 2.6666667e-3 |
| Example with two trains    |    0.027 |    0.028 |    0.028 |  0.027666667 |
| Shared Segment             |    0.012 |    0.014 |    0.014 |  0.013333333 |
| Large Network              |    0.011 |    0.012 |    0.020 |  0.014333333 |
| Station One                |    0.019 |    0.018 |    0.021 |  0.019333333 |
| Station Two                |    0.077 |    0.064 |    0.076 |  0.072333333 |
| Station Four               |    1.253 |    1.375 |    1.291 |    1.3063333 |
| Station Six                |   21.982 |   22.389 |   22.220 |       22.197 |
| Station Eight              |  134.299 |  134.362 |  135.154 |      134.605 |
| Station Ten                |  470.486 |  452.370 |  444.189 |    455.68167 |
| Station Twelfth            | 1279.219 | 1260.140 | 1274.903 |    1271.4207 |
| Two trains same direction  |    0.021 |    0.018 |    0.014 |  0.017666667 |
| Four trains same direction |  805.680 |  789.951 |  792.274 |    795.96833 |
| Nærumbanen (2T)            |   20.903 |   20.225 |   20.123 |       20.417 |
| Nærumbanen (3T)            |  334.085 |  331.171 |  336.187 |    333.81433 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   7.520 |   7.524 |   7.524 | 7.5226667 |
| Example with two trains    |   8.480 |   8.480 |   8.500 | 8.4866667 |
| Shared Segment             |   9.700 |   9.720 |   9.724 | 9.7146667 |
| Large Network              |  11.920 |  11.920 |  11.928 | 11.922667 |
| Station One                |   8.440 |   8.440 |   8.460 | 8.4466667 |
| Station Two                |  12.312 |  12.356 |  12.364 |    12.344 |
| Station Four               |  37.080 |  37.260 |  37.284 |    37.208 |
| Station Six                | 100.220 | 100.576 | 100.608 |   100.468 |
| Station Eight              | 220.080 | 221.836 | 221.916 | 221.27733 |
| Station Ten                | 422.496 | 427.152 | 427.152 |     425.6 |
| Station Twelfth            | 728.620 | 731.976 | 731.903 |   730.833 |
| Two trains same direction  |   9.844 |   9.864 |   9.872 |      9.86 |
| Four trains same direction | 687.712 | 687.712 | 687.716 | 687.71333 |
| Nærumbanen (2T)            | 114.784 | 115.532 | 115.716 |   115.344 |
| Nærumbanen (3T)            | 285.640 | 286.228 | 286.300 |   286.056 |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

